-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- ホスト: mysql712.db.sakura.ne.jp
-- 生成日時: 2025 年 6 月 29 日 16:28
-- サーバのバージョン： 5.7.40-log
-- PHP のバージョン: 8.2.16

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `familyline_asjas`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `q0001_user`
--

CREATE TABLE `q0001_user` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `q0002_id` bigint(20) UNSIGNED DEFAULT NULL,
  `name` varchar(50) NOT NULL,
  `email` varchar(255) DEFAULT NULL,
  `phone` varchar(50) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- テーブルのデータのダンプ `q0001_user`
--

INSERT INTO `q0001_user` (`id`, `q0002_id`, `name`, `email`, `phone`, `created_at`) VALUES
(1, 1, 'user1_1', 'yeung@purecode.jp', '0011', '2024-01-19 10:20:07'),
(2, 1, 'user1_2', 'user1_2@asjas.org', '0012', '2024-01-19 11:01:58'),
(3, 1, 'user1_3', 'user1_3@asjas.org', '0013', '2024-01-19 11:01:59'),
(4, 2, 'user1_4', 'user1_4@asjas.org', '0014', '2024-01-19 11:02:01'),
(5, 2, 'user1_5', 'user1_5@asjas.org', '0015', '2024-01-19 11:02:04'),
(6, 2, 'user1_6', 'user1_6@asjas.org', '0016', '2024-01-19 11:02:07'),
(7, 3, 'user2_1', 'user2_1@asjas.org', '0021', '2024-01-19 11:02:07'),
(8, 3, 'user2_2', 'user2_2@asjas.org', '0022', '2024-01-19 11:02:07');

-- --------------------------------------------------------

--
-- テーブルの構造 `q0002_team`
--

CREATE TABLE `q0002_team` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `q0012_id` bigint(20) UNSIGNED DEFAULT NULL,
  `leader_id` int(11) DEFAULT NULL,
  `other_email` varchar(256) DEFAULT NULL,
  `name` varchar(50) NOT NULL,
  `school` varchar(200) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- テーブルのデータのダンプ `q0002_team`
--

INSERT INTO `q0002_team` (`id`, `q0012_id`, `leader_id`, `other_email`, `name`, `school`) VALUES
(1, 1, 1, NULL, 'school1_1', 'school1'),
(2, 1, 4, NULL, 'school1_2', 'school1'),
(3, 1, 6, NULL, 'school2', 'school2');

-- --------------------------------------------------------

--
-- テーブルの構造 `q0004_user_answer`
--

CREATE TABLE `q0004_user_answer` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `q0001_id` bigint(20) UNSIGNED NOT NULL,
  `q0012_id` bigint(20) UNSIGNED NOT NULL,
  `q0021_id` bigint(20) UNSIGNED NOT NULL,
  `answer` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- テーブルのデータのダンプ `q0004_user_answer`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `q0011_game`
--

CREATE TABLE `q0011_game` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- テーブルのデータのダンプ `q0011_game`
--

INSERT INTO `q0011_game` (`id`, `name`) VALUES
(1, '問題集1'),
(2, '問題集2'),
(3, '问题集1'),
(4, '问题集2'),
(5, 'SAMPLE1'),
(6, 'SAMPLE2');

-- --------------------------------------------------------

--
-- テーブルの構造 `q0012_event`
--

CREATE TABLE `q0012_event` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(50) NOT NULL,
  `event_date` datetime DEFAULT NULL,
  `ref_id` varchar(50) DEFAULT NULL,
  `city` varchar(50) NOT NULL,
  `active` bit(1) NOT NULL DEFAULT b'0',
  `result` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- テーブルのデータのダンプ `q0012_event`
--

INSERT INTO `q0012_event` (`id`, `name`, `event_date`, `ref_id`, `city`, `active`, `result`) VALUES
(1, 'SAMPLE EVENT', '2024-02-17 00:00:00', NULL, 'hk', b'0', NULL),
;

-- --------------------------------------------------------

--
-- テーブルの構造 `q0013_event_game_rel`
--

CREATE TABLE `q0013_event_game_rel` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(256) DEFAULT NULL,
  `game_date` text,
  `start_time` datetime DEFAULT NULL,
  `end_time` datetime DEFAULT NULL,
  `q0011_id` bigint(20) UNSIGNED NOT NULL,
  `q0012_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- テーブルのデータのダンプ `q0013_event_game_rel`
--

INSERT INTO `q0013_event_game_rel` (`id`, `name`, `game_date`, `start_time`, `end_time`, `q0011_id`, `q0012_id`) VALUES
(1, '第一回合 1', NULL, '2024-02-17 11:00:00', '2024-02-17 11:15:00', 1, 1),
;

-- --------------------------------------------------------

--
-- テーブルの構造 `q0021_question`
--

CREATE TABLE `q0021_question` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `q0011_id` bigint(20) UNSIGNED NOT NULL,
  `image` varchar(255) DEFAULT NULL,
  `question` varchar(255) NOT NULL,
  `choices1` varchar(255) NOT NULL,
  `choices2` varchar(255) NOT NULL,
  `choices3` varchar(255) NOT NULL,
  `choices4` varchar(255) NOT NULL,
  `answer` int(11) NOT NULL,
  `view_order` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- テーブルのデータのダンプ `q0021_question`
--

INSERT INTO `q0021_question` (`id`, `q0011_id`, `image`, `question`, `choices1`, `choices2`, `choices3`, `choices4`, `answer`, `view_order`) VALUES
(1, 5, 'q1.jpg', 'q1_1', 'c1_1', 'c1_2', 'c1_3', 'c1_4', 1, 1),
(2, 5, NULL, 'q2_1', 'c2_1', 'c2_2', 'c2_3', 'c2_4', 2, 2),
(3, 5, 'q3.jpg', 'q3_1', 'c3_1', 'c3_2', 'c3_3', 'c3_4', 3, 3),
(4, 5, NULL, 'q4_1', 'c4_1', 'c4_2', 'c4_3', 'c4_4', 4, 4),
(5, 6, NULL, 'q5_1', 'c5_1', 'c5_2', 'c5_3', 'c5_4', 1, 1),
(6, 6, NULL, 'q6_1', 'c6_1', 'c6_2', 'c6_3', 'c6_4', 1, 1),
(7, 6, NULL, 'q7_1', 'c7_1', 'c7_2', 'c7_3', 'c7_4', 1, 1),
(8, 1, NULL, '日本的國花是什麼？', '錦鳥花', '櫻花', '蓮花', '大紅花', 2, 1),
(9, 1, NULL, '日本的傳統劍術是什麼？', '空手道', '劍道', '柔道', '合氣道', 4, 2),
(10, 1, NULL, '日本的傳統和服是由幾件衣物組成？', '一件', '兩件', '三件', '四件', 3, 3),
(11, 1, NULL, '根據最新的統計資料在日本的香港留學生有多少人？', '500人', '1500人', '2500人', '5000人', 3, 4),
(12, 1, NULL, '日本的傳統茶道是通過什麼方式表達？', '畫', '書法', '舞蹈', '泡茶', 4, 5),
(13, 1, NULL, '日本的傳統節日\"七夕\"是在哪一天慶祝？', '1月1日', '7月7日', '10月31日', '12月25日', 2, 6),
(14, 1, NULL, '日本的傳統戲劇形式是什麼？', '能', '狂言', '歌舞伎', '相撲', 3, 7),
(15, 1, NULL, '日本的主要民族是大和民族，少數民族是哪一族？', '阿伊努族', '維吾爾族', '哈薩克族', '土家族', 1, 8),
(16, 1, NULL, '根據日本政府的統計資料，留學生大學畢業之後，還留在日本的比例是多少？', '大概20%', '大概30%', '大概40%', '大概60%', 4, 9),
(17, 1, NULL, '日本的留學生在需要上課的期間，一星期最多可以工作多少小時兼職？', '18', '20', '24', '28', 4, 18),
(18, 1, NULL, '會中文的同學，從零開始學習，最快需要多少時間學習，可以達到大學要求的日語水準入讀日語的學士課程？', '6個月', '1年', '2年', '3年', 1, 11),
(19, 1, NULL, '在日本大學讀書的留學生，平均一年支付的學費是多少港元？', '3萬5千港元', '4萬5千港元', '6萬5千港元', '10萬港元', 1, 23),
(20, 1, NULL, '現在日本大概有多少所大學？', '大概100所', '大概400所', '大概600所', '大概800所', 4, 13),
(21, 1, NULL, '日本的傳統音樂樂器\"琴\"屬于以下哪種類型？', '弦樂器', '銅管樂器', '鍵盤樂器', '敲擊樂器', 1, 14),
(22, 1, NULL, '日本的傳統服飾\"和服\"是由幾層組成？', '1層', '2層', '3層', '4層', 3, 15),
(23, 1, NULL, '日本的傳統游戲\"跳繩\"在日本被稱為什麼？', '玩具舞蹈', '跳舞繩', '跳繩歌', '跳舞歌', 3, 16),
(24, 1, NULL, '日本的傳統戲劇形式\"歌舞伎\"起源于哪個時期？', '平安時代', '室町時代', '江戶時代', '明治時代', 3, 17),
(25, 1, NULL, '天皇家族的家徽是菊花圖案，皇室家徽的\"菊紋\"有多少花瓣？', '12', '14', '16', '18', 4, 10),
(26, 1, NULL, '日本的入學典禮和公司的入社典禮是在幾月舉行?', '1月', '4月', '6月', '9月', 2, 19),
(27, 1, NULL, '日本一共47個一級行政區劃的都道府，有多少個縣？', '18', '28', '43', '52', 3, 20),
(28, 1, NULL, '神社門口的牌坊叫做什麼？', '鳥居', '宮門', '木戸', '玄関', 1, 21),
(29, 1, NULL, '在日本的神社里，信徒會將香油錢投進錢箱以求與神有緣，通常會投什麼錢幣', '1日円', '5日円', '100日円', '500日円', 2, 22),
(30, 1, NULL, '歌舞伎是從前的什麼古國的始祖？', '綾國', '松國', '阿國', '戰國', 3, 12),
(31, 1, NULL, '日本國歌叫《君之代》；來自什麼的歌集？', '古今和歌集', '万葉集', '勅撰和歌集', '紀貫之歌集', 1, 24),
(32, 1, NULL, '日本人習慣在神社拜拜後抽簽卜吉兇，如果抽中不祥的簽時，會放在神社的哪裡？', '門上', '柱上', '樹上', '地上', 3, 25),
(33, 1, NULL, '被認為世界上最古老的木制建筑位于什麼地方？', '奈良', '京都', '鎌倉', '長野', 1, 26),
(34, 1, NULL, '相撲里的「土俵」是指比賽的場地，相撲選手在比賽前會在場地上撒鹽，目的是為了什麼？', '勝利', '避邪', '健康', '清潔', 2, 27),
(35, 1, NULL, '日本的NHK臺的紅白歌唱對抗賽是十二月三十一日舉行，這一天叫做什麼？', '年末日', '元旦日', '除夕日', '大晦日', 4, 28),
(36, 1, NULL, '日本的黃金假期是在四月底到五月初，有大約一周的連休，稱作什麼？', '黄金週', '春休', '大連休', '盆休', 1, 29),
(37, 1, NULL, '得到諾貝爾文學獎的日本作家那一位？', '上村春樹', '川端康成', '司馬遼太郎', '星新一', 2, 30),
(38, 2, NULL, '日本的第一蘋果產地是哪裡？', '長野', '山梨', '仙台', '青森', 4, 1),
(39, 2, NULL, '在日本的社會里，什麼血型的人最多？', 'A', 'B', 'AB', 'O', 1, 2),
(40, 2, NULL, '日本的第二高的山是那一座?', '奥穂高岳', '富士山', '御嶽山', '北岳', 4, 3),
(41, 2, NULL, '日本被分為地區，例如 關東地區，中部地區，近畿地區，合計有多少地區？', '6', '9', '11', '15', 2, 4),
(42, 2, NULL, '以下那一個不是日本的三大傳統藝術？', '歌舞伎', '能劇', '文樂', '狂言', 3, 5),
(43, 2, NULL, '日本的國技是相撲，拿一個最級別高？', '十兩', '大関', '前頭', '橫綱', 4, 6),
(44, 2, NULL, '日本的義務教育是幾年？', '6年', '9年', '12年', '16年', 2, 7),
(45, 2, NULL, '以下那一個不是日本三大庭院', '後楽園', '六義園', '偕楽園', '兼六園', 2, 8),
(46, 2, NULL, '日本的人口?', '1億2千萬人', '1億5千萬人', '1億8千萬人', '2億人', 1, 9),
(47, 2, NULL, '日本主要由幾個大島組成？', '3', '4', '5', '6', 2, 10),
(48, 2, NULL, '以下哪一個城市沒有有中華街？', '橫濱', '大阪', '神戶', '長崎', 2, 11),
(49, 2, NULL, '以下哪一個不是日本的三大夜景城市？', '函館', '神戶', '千葉', '長崎', 3, 12),
(50, 2, NULL, '日本的一般平民到什麼年代才開始有姓？', '明治時代', '昭和時代', '平安時代', '鎌倉時代', 1, 13),
(51, 2, NULL, '東京成功舉辦了兩次奧運會，第一次是在哪年舉行', '1958年', '1961年', '1964年', '1968年', 3, 14),
(52, 2, NULL, '日本警察局和急救中心的電話號碼？', '‘001', '100', '110', '999', 3, 15),
(53, 2, NULL, '日本高中生棒球大會的舉辦地在哪裡？', '東京', '大阪', '名古屋', '福岡', 2, 16),
(54, 2, NULL, '日本最長的河川？', '信濃川', '隅田川', '淀川', '利根川', 1, 17),
(55, 2, NULL, '日本最大的湖是？', '支笏湖', '猪苗代湖', '十和田湖', '琵琶湖', 4, 18),
(56, 2, NULL, '哪一個不是⽇本東北三⼤傳統節⽇？', '七夕祭', '祇園祭', '竿燈祭', '寢豚祭', 2, 19),
(57, 2, NULL, '在日本的鎖國時代，唯一對外開放的城市是哪裡？', '大阪', '東京', '神戸', '長崎', 4, 20),
(58, 2, NULL, '日本有名的雪祭是哪一個月進行？', '11月', '12月', '1月', '2月', 4, 21),
(59, 2, NULL, '日本的職業棒球一共幾個聯盟？', '1個', '2個', '3個', '4個', 2, 22),
(60, 2, NULL, '日本人在除夕夜必吃什麼？', '冷麺', '拉麺', '烏冬麵', '蕎麥麵', 4, 23),
(61, 2, NULL, '在日本一級行政區域中面積最大哪裡？', '東京', '大阪', '京都', '北海道', 4, 24),
(62, 2, NULL, '日本硬幣最大面值是多少日元？', '100日元', '200日元', '500日元', '1000日元', 3, 25),
(63, 2, NULL, '日本山地面積占全國總面積的多少%？', '50%', '55%', '65%', '75%', 4, 26),
(64, 2, NULL, '日本人必學的基礎漢字約多少字？', '1千個字', '2千個字', '5千個字', '8千個字', 2, 27),
(65, 2, NULL, '日本的女兒節（ひな祭り）在幾月？', '3月', '5月', '7月', '9月', 1, 28),
(66, 2, NULL, '日語「天狗」是什麼的意思？', '靈活', '健康', '強壮', '自夸', 4, 29),
(67, 2, NULL, '世界上最古老的長篇寫實小說是《源氏物語》，產生在什麼時代？', '平安時代', '飛鳥時代', '奈良時代', '鎌倉時代', 1, 30),
(68, 3, NULL, '日本的国花是什麽？', '锦鸟花', '樱花', '莲花', '大红花', 2, 1),
(69, 3, NULL, '日本的传统剑术是什麽？', '空手道', '剑道', '柔道', '合气道', 4, 2),
(70, 3, NULL, '日本的传统和服是由几件衣物组成？', '一件', '两件', '三件', '四件', 3, 3),
(71, 3, NULL, '日本的传统乐器是什麽？', '三味线', '尺八', '大鼓', '筝', 1, 4),
(72, 3, NULL, '日本的传统茶道是通过什麽方式表达？', '画', '书法', '舞蹈', '泡茶', 4, 5),
(73, 3, NULL, '日本的传统节日\"七夕\"是在哪一天庆祝？', '1月1日', '7月7日', '10月31日', '12月25日', 2, 6),
(74, 3, NULL, '日本的传统戏剧形式是什麽？', '能', '狂言', '歌舞伎', '相扑', 3, 7),
(75, 3, NULL, '日本的主要民族是大和民族，少数民族是哪一族？', '阿伊努族', '维吾尔族', '哈萨克族', '土家族', 1, 8),
(76, 3, NULL, '日本的传统绘画形式是什麽？', '油画', '水彩画', '书法', '绘画', 4, 9),
(77, 3, NULL, '日本的传统食物\"拉面\"是使用什麽面条？', '细面', '双宽面', '粗面', '手擀面', 2, 10),
(78, 3, NULL, '日本的传统房屋\"茅草屋\"是使用什麽材料建造？', '瓦片', '石头', '茅草', '木材', 3, 11),
(79, 3, NULL, '日本的传统舞蹈形式是什麽？', '芭蕉舞', '舞剑舞', '茶道舞', '舞龙舞', 1, 12),
(80, 3, NULL, '日本的传统游戏\"打球\"是使用什麽球？', '篮球', '足球', '棒球', '打球球', 4, 13),
(81, 3, NULL, '日本的传统音乐乐器\"琴\"属于以下哪种类型？', '弦乐器', '铜管乐器', '键盘乐器', '敲击乐器', 1, 14),
(82, 3, NULL, '日本的传统服饰\"和服\"是由几层组成？', '1层', '2层', '3层', '4层', 3, 15),
(83, 3, NULL, '日本的传统游戏\"跳绳\"在日本被称为什麽？', '玩具舞蹈', '跳舞绳', '跳绳歌', '跳舞歌', 3, 16),
(84, 3, NULL, '日本的传统戏剧形式\"歌舞伎\"起源于哪个时期？', '平安时代', '室町时代', '江户时代', '明治时代', 3, 17),
(85, 3, NULL, '天皇家族的家徽是菊花图案，皇室家徽的\"菊纹\"有多少花瓣？', '12', '14', '16', '18', 4, 18),
(86, 3, NULL, '日本的入学典礼和公司的入社典礼是在几月举行?', '1月', '4月', '6月', '9月', 2, 19),
(87, 3, NULL, '日本一共47个一级行政区划的都道府，有多少个县？', '18', '28', '43', '52', 3, 20),
(88, 3, NULL, '神社门口的牌坊叫做什麽？', '鸟居', '宫门', '木戸', '玄関', 1, 21),
(89, 3, NULL, '在日本的神社里，信徒会将香油钱投进钱箱以求与神有缘，通常会投什麽钱币', '1日円', '5日円', '100日円', '500日円', 2, 22),
(90, 3, NULL, '歌舞伎是从前的什麽古国的始祖？', '绫国', '松国', '阿国', '战国', 3, 23),
(91, 3, NULL, '日本国歌叫《君之代》；来自什麽的歌集？', '古今和歌集', '万叶集', '勅撰和歌集', '纪贯之歌集', 1, 24),
(92, 3, NULL, '日本人习惯在神社拜拜後抽签卜吉凶，如果抽中不祥的签时，会放在神社的哪里？', '门上', '柱上', '树上', '地上', 3, 25),
(93, 3, NULL, '被认为世界上最古老的木制建筑位于什麽地方？', '奈良', '京都', '鎌仓', '长野', 1, 26),
(94, 3, NULL, '相扑里的「土俵」是指比赛的场地，相扑选手在比赛前会在场地上撒盐，目的是为了什麽？', '胜利', '避邪', '健康', '清洁', 2, 27),
(95, 3, NULL, '日本的NHK台的红白歌唱对抗赛是十二月三十一日举行，这一天叫做什麽？', '年末日', '元旦日', '除夕日', '大晦日', 4, 28),
(96, 3, NULL, '日本的黄金假期是在四月底到五月初，有大约一周的连休，称作什麽？', '黄金周', '春休', '大连休', '盆休', 1, 29),
(97, 3, NULL, '得到诺贝尔文学奖的日本作家那一位？', '上村春树', '川端康成', '司马辽太郎', '星新一', 2, 30),
(98, 4, NULL, '日本的第一苹果产地是哪里？', '长野', '山梨', '仙台', '青森', 4, 1),
(99, 4, NULL, '在日本的社会里，什麽血型的人最多？', 'A', 'B', 'AB', 'O', 1, 2),
(100, 4, NULL, '日本的第二高的山是那一座?', '奥穂高岳', '富士山', '御岳山', '北岳', 4, 3),
(101, 4, NULL, '日本被分为地区，例如 关东地区，中部地区，近畿地区，合计有多少地区？', '6', '9', '11', '15', 2, 4),
(102, 4, NULL, '以下那一个不是日本的三大传统艺术？', '歌舞伎', '能剧', '文乐', '狂言', 3, 5),
(103, 4, NULL, '日本的国技是相扑，拿一个最级别高？', '十两', '大関', '前头', '横纲', 4, 6),
(104, 4, NULL, '日本的义务教育是几年？', '6年', '9年', '12年', '16年', 2, 7),
(105, 4, NULL, '以下那一个不是日本三大庭院', '後楽园', '六义园', '偕楽园', '兼六园', 2, 8),
(106, 4, NULL, '日本的人口?', '1亿2千万人', '1亿5千万人', '1亿8千万人', '2亿人', 1, 9),
(107, 4, NULL, '日本主要由几个大岛组成？', '3', '4', '5', '6', 2, 10),
(108, 4, NULL, '以下哪一个城市没有有中华街？', '横滨', '大阪', '神户', '长崎', 2, 11),
(109, 4, NULL, '以下哪一个不是日本的三大夜景城市？', '函馆', '神户', '千叶', '长崎', 3, 12),
(110, 4, NULL, '日本的一般平民到什麽年代才开始有姓？', '明治时代', '昭和时代', '平安时代', '鎌仓时代', 1, 13),
(111, 4, NULL, '东京成功举办了两次奥运会，第一次是在哪年举行', '1958年', '1961年', '1964年', '1968年', 3, 14),
(112, 4, NULL, '日本警察局和急救中心的电话号码？', '‘001', '100', '110', '999', 3, 15),
(113, 4, NULL, '日本高中生棒球大会的举办地在哪里？', '东京', '大阪', '名古屋', '福冈', 2, 16),
(114, 4, NULL, '日本最长的河川？', '信浓川', '隅田川', '淀川', '利根川', 1, 17),
(115, 4, NULL, '日本最大的湖是？', '支笏湖', '猪苗代湖', '十和田湖', '琵琶湖', 4, 18),
(116, 4, NULL, '哪一个不是⽇本东北三⼤传统节⽇？', '七夕祭', '只园祭', '竿灯祭', '寝豚祭', 2, 19),
(117, 4, NULL, '在日本的锁国时代，唯一对外开放的城市是哪里？', '大阪', '东京', '神戸', '长崎', 4, 20),
(118, 4, NULL, '日本有名的雪祭是哪一个月进行？', '11月', '12月', '1月', '2月', 4, 21),
(119, 4, NULL, '日本的职业棒球一共几个联盟？', '1个', '2个', '3个', '4个', 2, 22),
(120, 4, NULL, '日本人在除夕夜必吃什麽？', '冷麺', '拉麺', '乌冬面', '荞麦面', 4, 23),
(121, 4, NULL, '在日本一级行政区域中面积最大哪里？', '东京', '大阪', '京都', '北海道', 4, 24),
(122, 4, NULL, '日本硬币最大面值是多少日元？', '100日元', '200日元', '500日元', '1000日元', 3, 25),
(123, 4, NULL, '日本山地面积占全国总面积的多少%？', '50%', '55%', '65%', '75%', 4, 26),
(124, 4, NULL, '日本人必学的基础汉字约多少字？', '1千个字', '2千个字', '5千个字', '8千个字', 2, 27),
(125, 4, NULL, '日本的女儿节（ひな祭り）在几月？', '3月', '5月', '7月', '9月', 1, 28),
(126, 4, NULL, '日语「天狗」是什麽的意思？', '灵活', '健康', '强壮', '自夸', 4, 29),
(127, 4, NULL, '世界上最古老的长篇写实小说是《源氏物语》，产生在什麽时代？', '平安时代', '飞鸟时代', '奈良时代', '鎌仓时代', 1, 30);

-- --------------------------------------------------------

--
-- テーブルの構造 `q0022_question_show_record`
--

CREATE TABLE `q0022_question_show_record` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `q0012_id` bigint(20) UNSIGNED NOT NULL,
  `q0021_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- テーブルのデータのダンプ `q0022_question_show_record`
--

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `q0001_user`
--
ALTER TABLE `q0001_user`
  ADD PRIMARY KEY (`id`);

--
-- テーブルのインデックス `q0002_team`
--
ALTER TABLE `q0002_team`
  ADD PRIMARY KEY (`id`);

--
-- テーブルのインデックス `q0004_user_answer`
--
ALTER TABLE `q0004_user_answer`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `q0001_id_q0012_id_q0021_id` (`q0001_id`,`q0012_id`,`q0021_id`);

--
-- テーブルのインデックス `q0011_game`
--
ALTER TABLE `q0011_game`
  ADD PRIMARY KEY (`id`);

--
-- テーブルのインデックス `q0012_event`
--
ALTER TABLE `q0012_event`
  ADD PRIMARY KEY (`id`);

--
-- テーブルのインデックス `q0013_event_game_rel`
--
ALTER TABLE `q0013_event_game_rel`
  ADD PRIMARY KEY (`id`);

--
-- テーブルのインデックス `q0021_question`
--
ALTER TABLE `q0021_question`
  ADD PRIMARY KEY (`id`);

--
-- テーブルのインデックス `q0022_question_show_record`
--
ALTER TABLE `q0022_question_show_record`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `q0012_id_q0021_id` (`q0012_id`,`q0021_id`);

--
-- ダンプしたテーブルの AUTO_INCREMENT
--

--
-- テーブルの AUTO_INCREMENT `q0001_user`
--
ALTER TABLE `q0001_user`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=90;

--
-- テーブルの AUTO_INCREMENT `q0002_team`
--
ALTER TABLE `q0002_team`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=79;

--
-- テーブルの AUTO_INCREMENT `q0004_user_answer`
--
ALTER TABLE `q0004_user_answer`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1833;

--
-- テーブルの AUTO_INCREMENT `q0011_game`
--
ALTER TABLE `q0011_game`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- テーブルの AUTO_INCREMENT `q0012_event`
--
ALTER TABLE `q0012_event`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- テーブルの AUTO_INCREMENT `q0013_event_game_rel`
--
ALTER TABLE `q0013_event_game_rel`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- テーブルの AUTO_INCREMENT `q0021_question`
--
ALTER TABLE `q0021_question`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=128;

--
-- テーブルの AUTO_INCREMENT `q0022_question_show_record`
--
ALTER TABLE `q0022_question_show_record`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=540;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
